import { getJoTableOfKingdomOfJudah } from "./getJoTableOfKingdomOfJudah.js";
export function replaceApiResult(com_text, address) {
    // 直接取代某些特殊的回傳結果，尤其是處理 table

    const bookid = address[0];
    const chap = address[1];
    const sec = address[2];

    if (bookid == 43 && chap == 1) {
        if (sec >= 6 && sec <= 8) {
            return replace_John_1_6(com_text)
        }
    }

    if (bookid == 17 && chap == 0) {
        // 以斯帖記背景
        return replace_17_0_0(com_text)
    }
    if (bookid == 11 && chap == 0) {
        // 列王記上背景
        return replace_11_0_0(com_text)
    }
    if (bookid == 13 && chap == 0) {
        // 歷代志上背景
        return replace_13_0_0(com_text)
    }
    if (bookid == 23) {
        if (chap == 0) {
            // 以賽亞書背景
            return replace_23_0_0(com_text)
        }
        if (chap == 7 && (sec >= 10 && sec <= 16)) {
            // 以賽亞書 7:10-16 的背景
            return replace_23_7_10(com_text)
        }
    }
    return com_text

}

function replace_John_1_6(com_text) {

    const v1 = `以下表格取自宣道出版社的「約翰福音
            詮釋」馬有藻著
            ┌────┬────────────┬───────────┐
            │差異    │   施洗約翰             │ 光╱道╱耶穌         │
            ├────┼────────────┼───────────┤
            │本質    │歷史人物                │太初有道（永恆者）    │
            ├────┼────────────┼───────────┤
            │來源    │從神而來                │與神同在              │
            ├────┼────────────┼───────────┤
            │身份    │受上帝所差              │道就是神              │ 
            ├────┼────────────┼───────────┤
            │職分    │為光作見證              │就是人的光            │
            ├────┼────────────┼───────────┤
            │目標    │因他可以信（介紹人）    │信的對象              │
            └────┴────────────┴───────────┘`

    const joTable = {
        rows: 6,
        cols: 3,
        cells: [
            { r: 0, c: 0, text: "差異" },
            { r: 0, c: 1, text: "施洗約翰" },
            { r: 0, c: 2, text: "光╱道╱耶穌" },
            { r: 1, c: 0, text: "本質" },
            { r: 1, c: 1, text: "歷史人物" },
            { r: 1, c: 2, text: "太初有道（永恆者）" },
            { r: 2, c: 0, text: "來源" },
            { r: 2, c: 1, text: "從神而來" },
            { r: 2, c: 2, text: "與神同在" },
            { r: 3, c: 0, text: "身份" },
            { r: 3, c: 1, text: "受上帝所差" },
            { r: 3, c: 2, text: "道就是神" },
            { r: 4, c: 0, text: "職分" },
            { r: 4, c: 1, text: "為光作見證" },
            { r: 4, c: 2, text: "就是人的光" },
            { r: 5, c: 0, text: "目標" },
            { r: 5, c: 1, text: "因他可以信（介紹人）" },
            { r: 5, c: 2, text: "信的對象" },
        ]
    }

    const header = "            詮釋」馬有藻著"
    const blockStart = com_text.indexOf(header)
    if (blockStart === -1) { return com_text }
    const blockSart2 = com_text.indexOf("┌", blockStart)
    if (blockSart2 === -1) { return com_text }
    const blockEnd = com_text.indexOf("┘", blockSart2)
    if (blockEnd === -1) { return com_text }

    // ✅ 取「header 所在行」的前置空白當作 indent（讓 JSON 跟著縮排）
    const indent = getLineIndentAt(com_text, blockStart);

    const jsonLine = `${indent}${JSON.stringify(joTable)}`;

    return (
        com_text.slice(0, blockStart + header.length) +
        `\n${jsonLine}\n` +
        com_text.slice(blockEnd + 1)
    );
}

/**
* 以斯帖記 背景
* @param {string} com_text 
 */
function replace_17_0_0(com_text) {
    return replace_4(replace_3(replace_2(replace_1(com_text))))
    return replace_3(replace_2(replace_1(com_text)))
    return replace_2(replace_1(com_text))
    return replace_1(com_text)

    return com_text

    function replace_1(text) {
        /*
            （四）#6:1|是故事的文體結構中心。
        
                        ┌ 開場白與背景（#斯 1|）             ┐
                      ┌┼ 國王第一次下旨（#斯 2; 斯 3|）     │→ 險些喪命
                    ┌┼┼ 哈曼與末底改的衝突（#斯 4; 斯 5|） ┘
                  ←┼┼┼ 國王睡不著之夜（#斯 6:1|）           → 危機
                    └┼┼ 末底改勝過哈曼（#斯 6; 斯 7|）     ┐
                      └┼ 國王第二次下旨（#斯 8; 斯 9|）     │→ 拯救
                        └ 後記（#斯 10|）   
        */

        const joTable = {
            rows: 7,
            cols: 4,
            cells: [
                { r: 0, c: 0, text: "　　　　┌ " },
                { r: 1, c: 0, text: "　　　┌┼ " },
                { r: 2, c: 0, text: "　　┌┼┼ " },
                { r: 3, c: 0, text: "←┼┼┼ " },
                { r: 4, c: 0, text: "　　└┼┼ " },
                { r: 5, c: 0, text: "　　　└┼ " },
                { r: 6, c: 0, text: "　　　　└ " },
                { r: 0, c: 1, text: "開場白與背景" },
                { r: 1, c: 1, text: "國王第一次下旨" },
                { r: 2, c: 1, text: "哈曼與末底改的衝突" },
                { r: 3, c: 1, text: "國王睡不著之夜" },
                { r: 4, c: 1, text: "末底改勝過哈曼" },
                { r: 5, c: 1, text: "國王第二次下旨" },
                { r: 6, c: 1, text: "後記" },
                { r: 0, c: 2, text: "（#斯 1|）" },
                { r: 1, c: 2, text: "（#斯 2; 斯 3|）" },
                { r: 2, c: 2, text: "（#斯 4; 斯 5|）" },
                { r: 3, c: 2, text: "（#斯 6:1|）" },
                { r: 4, c: 2, text: "（#斯 6; 斯 7|）" },
                { r: 5, c: 2, text: "（#斯 8; 斯 9|）" },
                { r: 6, c: 2, text: "（#斯 10|）" },
                { r: 0, c: 3, text: "┐" },
                { r: 1, c: 3, text: "│→ 險些喪命" },
                { r: 2, c: 3, text: "┘" },
                { r: 3, c: 3, text: "→ 危機" },
                { r: 4, c: 3, text: "┐" },
                { r: 5, c: 3, text: "│→ 拯救" },
                { r: 6, c: 3, text: "" },
            ]
        }

        return replace_core(text, joTable, "（四）#6:1|是故事的文體結構中心。", "┌ 開場白與背景", "└ 後記（#斯 10|）")

    }
    function replace_2(text) {
        /*
        （一）古列王：波斯帝國的建立者
              西元前549年  繼承了瑪代帝國東部和北部的疆土。
              西元前547年  攻破呂底亞的哥羅賽(Croesus of Lydia)。
              西元前539年  巴比倫機乎沒有抵抗就投降古列，應驗了#賽 44:28;45:1|的
              預言。
              西元前530年  古列在東邊的戰役中陣亡，王位由甘比西斯繼承。    
        */

        const joTable = {
            rows: 4,
            cols: 2,
            cells: [
                { r: 0, c: 0, text: "西元前549年" },
                { r: 0, c: 1, text: "繼承了瑪代帝國東部和北部的疆土。" },
                { r: 1, c: 0, text: "西元前547年" },
                { r: 1, c: 1, text: "攻破呂底亞的哥羅賽(Croesus of Lydia)。" },
                { r: 2, c: 0, text: "西元前539年" },
                { r: 2, c: 1, text: "巴比倫機乎沒有抵抗就投降古列，應驗了#賽 44:28;45:1|的預言。" },
                { r: 3, c: 0, text: "西元前530年" },
                { r: 3, c: 1, text: "古列在東邊的戰役中陣亡，王位由甘比西斯繼承。" },
            ]
        }

        return replace_core(text, joTable, "（一）古列王：波斯帝國的建立者", "西元前549年", "古列在東邊的戰役中陣亡，王位由甘比西斯繼承。")
    }
    function replace_3(text) {
        /*
          六、以色列歷史概論：
                西元前1500年         摩西誕生、西元前1446年出埃及
                西元前1375-1050      士師時期
                西元前1050-1010      掃羅王
                西元前1010-970       大衛王
                西元前970-930        所羅門王
                西元前930            南北國分裂
                西元前722            北國被亞述滅亡 (以色列被擄至亞述)
                西元前586            南國被巴比倫滅亡 (耶路撒冷被毀, 猶大被擄至巴比倫)
                西元前540            波斯征服巴比倫
                西元前538            所羅巴伯領導第一次歸回 (第一批被擄的百姓歸回)
                西元前536            聖殿開始重建
                西元前530            聖殿重建工程中止
                西元前520            哈該、撒迦利亞呼籲聖殿重建工程恢復
                西元前516            聖殿重建完成
                西元前458            以斯拉領導第二次歸回
                西元前445            耶路撒冷城牆重建完成（52天）
                西元前432            尼希米（西元前445-420）領導第三次歸回
                西元前336-323        希臘亞歷山大帝國
                西元前250            七十士譯本
                西元前200            撒都該人興起
                西元前167            馬加比革命
                西元前166-142        馬加比王朝
                西元前165            法利賽人、愛色尼人、奮銳黨、希律黨興起
                西元前142-63         哈斯摩尼王朝
                西元前63             羅馬龐貝攻入耶路撒冷
                西元66-70            猶大戰爭，西元70年耶路撒冷被毀
                西元90               雅麥尼亞會議，確定舊約正典
        */
        const joTable = {
            rows: 25,
            cols: 2,
            cells: [
                { r: 0, c: 0, text: "西元前1500年" },
                { r: 0, c: 1, text: "摩西誕生、西元前1446年出埃及" },
                { r: 1, c: 0, text: "西元前1375-1050" },
                { r: 1, c: 1, text: "士師時期" },
                { r: 2, c: 0, text: "西元前1050-1010" },
                { r: 2, c: 1, text: "掃羅王" },
                { r: 3, c: 0, text: "西元前1010-970" },
                { r: 3, c: 1, text: "大衛王" },
                { r: 4, c: 0, text: "西元前970-930" },
                { r: 4, c: 1, text: "所羅門王" },
                { r: 5, c: 0, text: "西元前930" },
                { r: 5, c: 1, text: "南北國分裂" },
                { r: 6, c: 0, text: "西元前722" },
                { r: 6, c: 1, text: "北國被亞述滅亡 (以色列被擄至亞述)" },
                { r: 7, c: 0, text: "西元前586" },
                { r: 7, c: 1, text: "南國被巴比倫滅亡 (耶路撒冷被毀, 猶大被擄至巴比倫)" },
                { r: 8, c: 0, text: "西元前540" },
                { r: 8, c: 1, text: "波斯征服巴比倫" },
                { r: 9, c: 0, text: "西元前538" },
                { r: 9, c: 1, text: "所羅巴伯領導第一次歸回 (第一批被擄的百姓歸回)" },
                { r: 10, c: 0, text: "西元前536" },
                { r: 10, c: 1, text: "聖殿開始重建" },
                { r: 11, c: 0, text: "西元前530" },
                { r: 11, c: 1, text: "聖殿重建工程中止" },
                { r: 12, c: 0, text: "西元前520" },
                { r: 12, c: 1, text: "哈該、撒迦利亞呼籲聖殿重建工程恢復" },
                { r: 13, c: 0, text: "西元前516" },
                { r: 13, c: 1, text: "聖殿重建完成" },
                { r: 14, c: 0, text: "西元前458" },
                { r: 14, c: 1, text: "以斯拉領導第二次歸回" },
                { r: 15, c: 0, text: "西元前445" },
                { r: 15, c: 1, text: "耶路撒冷城牆重建完成（52天）" },
                { r: 16, c: 0, text: "西元前432" },
                { r: 16, c: 1, text: "尼希米（西元前445-420）領導第三次歸回" },
                { r: 17, c: 0, text: "西元前336-323" },
                { r: 17, c: 1, text: "希臘亞歷山大帝國" },
                { r: 18, c: 0, text: "西元前250" },
                { r: 18, c: 1, text: "七十士譯本" },
                { r: 19, c: 0, text: "西元前200" },
                { r: 19, c: 1, text: "撒都該人興起" },
                { r: 20, c: 0, text: "西元前167" },
                { r: 20, c: 1, text: "馬加比革命" },
                { r: 21, c: 0, text: "西元前166-142" },
                { r: 21, c: 1, text: "馬加比王朝" },
                { r: 22, c: 0, text: "西元前165" },
                { r: 22, c: 1, text: "法利賽人、愛色尼人、奮銳黨、希律黨興起" },
                { r: 23, c: 0, text: "西元前142-63" },
                { r: 23, c: 1, text: "哈斯摩尼王朝" },
                { r: 24, c: 0, text: "西元前63" },
                { r: 24, c: 1, text: "羅馬龐貝攻入耶路撒冷" },
                { r: 25, c: 0, text: "西元66-70" },
                { r: 25, c: 1, text: "猶大戰爭，西元70年耶路撒冷被毀" },
                { r: 26, c: 0, text: "西元90" },
                { r: 26, c: 1, text: "雅麥尼亞會議，確定舊約正典" },

            ]
        }
        return replace_core(text, joTable, "六、以色列歷史概論：", "西元前1500年", "雅麥尼亞會議，確定舊約正典")
    }
    function replace_4(text) {
        /*
          七、相關歷史年代表
                西元前549年  波斯帝國古列(塞魯士王)繼承了瑪代帝國東部和北部的疆土。
                西元前547年  古列攻破呂底亞的哥羅賽(Croesus of Lydia)。
                西元前539年  巴比倫投降古列，應驗了 #賽 44:28;45:1|的預言。
               *西元前538年  古列的上諭:以色列人在所羅巴伯領導下首次回歸耶路撒冷。
                西元前530年  古列在東邊的戰役中陣亡，王位由甘比西斯繼承。
                西元前522年  大利烏王(大流士)登基。
                西元前520年  大利烏王平定內亂。
               *西元前516年  以色列重建聖殿完成。
                西元前486年  薛西王一世(亞哈隨魯王)登基。
               *西元前486-480年  以斯帖記記載。
                西元前465年  亞達薛西王一世登基。
               *西元前458年  以斯拉帶領第二批回歸抵達耶路撒冷。
               *西元前445年  尼希米抵達耶路撒冷。
               *西元前444年  耶路撒冷城牆建造完畢。
                    西元前424年  大利烏王(大流士)二世登基。
               *西元前405年  亞達薛西王二世登基。
                西元前359年  亞達薛西王三世登基。
                西元前338年  大利烏王(大流士) 三世登基。
        */
        const joTable = {
            rows: 18,
            cols: 2,
            cells: [
                { r: 0, c: 0, text: "西元前549年" },
                { r: 0, c: 1, text: "波斯帝國古列(塞魯士王)繼承了瑪代帝國東部和北部的疆土。" },
                { r: 1, c: 0, text: "西元前547年" },
                { r: 1, c: 1, text: "古列攻破呂底亞的哥羅賽(Croesus of Lydia)。" },
                { r: 2, c: 0, text: "西元前539年" },
                { r: 2, c: 1, text: "巴比倫投降古列，應驗了 #賽 44:28;45:1|的預言。" },
                { r: 3, c: 0, text: "西元前538年" },
                { r: 3, c: 1, text: "古列的上諭:以色列人在所羅巴伯領導下首次回歸耶路撒冷。" },
                { r: 4, c: 0, text: "西元前530年" },
                { r: 4, c: 1, text: "古列在東邊的戰役中陣亡，王位由甘比西斯繼承。" },
                { r: 5, c: 0, text: "西元前522年" },
                { r: 5, c: 1, text: "大利烏王(大流士)登基。" },
                { r: 6, c: 0, text: "西元前520年" },
                { r: 6, c: 1, text: "大利烏王平定內亂。" },
                { r: 7, c: 0, text: "西元前516年" },
                { r: 7, c: 1, text: "以色列重建聖殿完成。" },
                { r: 8, c: 0, text: "西元前486年" },
                { r: 8, c: 1, text: "薛西王一世(亞哈隨魯王)登基。" },
                { r: 9, c: 0, text: "西元前486-480年" },
                { r: 9, c: 1, text: "以斯帖記記載。" },
                { r: 10, c: 0, text: "西元前465年" },
                { r: 10, c: 1, text: "亞達薛西王一世登基。" },
                { r: 11, c: 0, text: "西元前458年" },
                { r: 11, c: 1, text: "以斯拉帶領第二批回歸抵達耶路撒冷。" },
                { r: 12, c: 0, text: "西元前445年" },
                { r: 12, c: 1, text: "尼希米抵達耶路撒冷。" },
                { r: 13, c: 0, text: "西元前444年" },
                { r: 13, c: 1, text: "耶路撒冷城牆建造完畢。" },
                { r: 14, c: 0, text: "西元前424年" },
                { r: 14, c: 1, text: "大利烏王(大流士)二世登基。" },
                { r: 15, c: 0, text: "西元前405年" },
                { r: 15, c: 1, text: "亞達薛西王二世登基。" },
                { r: 16, c: 0, text: "西元前359年" },
                { r: 16, c: 1, text: "亞達薛西王三世登基。" },
                { r: 17, c: 0, text: "西元前338年" },
                { r: 17, c: 1, text: "大利烏王(大流士) 三世登基。" },
            ]
        }
        return replace_core(text, joTable, "七、相關歷史年代表", "西元前549", "大利烏王(大流士) 三世登基。")
    }
}
function replace_11_0_0(com_text) {
    const joTable = getJoTableOfKingdomOfJudah()
    return replace_core(com_text, joTable, "君王年代表很難被確定，以下是一份簡易的年代表：", "┌ ─ ─ ─ ─ ", "─ ─ ┴ ─ ─ ─ ─ ─ ─ ┘")
}
function replace_13_0_0(com_text) {
    const joTable = getJoTableOfKingdomOfJudah()
    return replace_core(com_text, joTable, "君王年代表很難被確定，以下是一份簡易的年代表：", "┌ ─ ─ ─ ─ ┬ ─ ─ ─ ─ ─ ─ ─ ┬ ─ ─ ─ ┬ ", "─ ─ ┴ ─ ─ ─ ─ ─ ─ ┘")
}
function replace_23_0_0(com_text) {
    /*
        （一）南國猶大（年代以獨自作王開始計算）：
              烏西雅 西元前 769-740年
              約坦   西元前 740-734年
              亞哈斯 西元前 734-715年
              希西家 西元前 715-686年
              瑪拿西 西元前 686-641年
              亞們   西元前 641-639年
    
        （三）北國以色列：
              耶羅波安二世  西元前784-753年
              撒迦利雅      西元前753-752年
              沙龍          西元前752-751年
              米拿現        西元前751-742年
              比加轄        西元前742-741年
              比加          西元前741-730年
              何細亞        西元前730-722年
    
        （五）相關年代整理（此處計算共同執政時間）
         以賽亞生　　西元前765年
              烏西雅在位  西元前789-740年
              以賽亞被召  西元前740年
              約坦在位    西元前740-736年
              亞哈斯在位  西元前736-727年
              希西家在位  西元前727-699年
              北國被擄    西元前722年
              希西家病    西元前714年
              瑪拿西在位  西元前699-643年
              以賽亞被殺  西元前681年以後
    */
    const joTable = {
        rows: 6, cols: 2, cells: [
            { r: 0, c: 0, text: "烏西雅" },
            { r: 0, c: 1, text: "西元前 769-740年" },
            { r: 1, c: 0, text: "約坦" },
            { r: 1, c: 1, text: "西元前 740-734年" },
            { r: 2, c: 0, text: "亞哈斯" },
            { r: 2, c: 1, text: "西元前 734-715年" },
            { r: 3, c: 0, text: "希西家" },
            { r: 3, c: 1, text: "西元前 715-686年" },
            { r: 4, c: 0, text: "瑪拿西" },
            { r: 4, c: 1, text: "西元前 686-641年" },
            { r: 5, c: 0, text: "亞們" },
            { r: 5, c: 1, text: "西元前 641-639年" },
        ]
    }

    const re1 = replace_core(com_text, joTable, "（一）南國猶大（年代以獨自作王開始計算）：", "烏西雅", "亞們   西元前 641-639年")

    const joTable2 = {
        rows: 7, cols: 2, cells: [
            { r: 0, c: 0, text: "耶羅波安二世" },
            { r: 0, c: 1, text: "西元前784-753年" },
            { r: 1, c: 0, text: "撒迦利雅" },
            { r: 1, c: 1, text: "西元前753-752年" },
            { r: 2, c: 0, text: "沙龍" },
            { r: 2, c: 1, text: "西元前752-751年" },
            { r: 3, c: 0, text: "米拿現" },
            { r: 3, c: 1, text: "西元前751-742年" },
            { r: 4, c: 0, text: "比加轄" },
            { r: 4, c: 1, text: "西元前742-741年" },
            { r: 5, c: 0, text: "比加" },
            { r: 5, c: 1, text: "西元前741-730年" },
            { r: 6, c: 0, text: "何細亞" },
            { r: 6, c: 1, text: "西元前730-722年" },
        ]
    }

    const re2 = replace_core(re1, joTable2, "（三）北國以色列：", "耶羅波安二世", "西元前730-722年")

    const joTable3 = {
        rows: 10, cols: 2, cells: [
            { r: 0, c: 0, text: "以賽亞生" },
            { r: 0, c: 1, text: "西元前765年" },
            { r: 1, c: 0, text: "烏西雅在位" },
            { r: 1, c: 1, text: "西元前789-740年" },
            { r: 2, c: 0, text: "以賽亞被召" },
            { r: 2, c: 1, text: "西元前740年" },
            { r: 3, c: 0, text: "約坦在位" },
            { r: 3, c: 1, text: "西元前740-736年" },
            { r: 4, c: 0, text: "亞哈斯在位" },
            { r: 4, c: 1, text: "西元前736-727年" },
            { r: 5, c: 0, text: "希西家在位" },
            { r: 5, c: 1, text: "西元前727-699年" },
            { r: 6, c: 0, text: "北國被擄" },
            { r: 6, c: 1, text: "西元前722年" },
            { r: 7, c: 0, text: "希西家病" },
            { r: 7, c: 1, text: "西元前714年" },
            { r: 8, c: 0, text: "瑪拿西在位" },
            { r: 8, c: 1, text: "西元前699-643年" },
            { r: 9, c: 0, text: "以賽亞被殺" },
            { r: 9, c: 1, text: "西元前681年以後" },
        ]
    }

    const re3 = replace_core(re2, joTable3, "（五）相關年代整理（此處計算共同執政時間）", "以賽亞生", "西元前681年以後")
    return re3

}
function replace_23_7_10(com_text) {
    /*
                ◎「兆」的相關用詞對照表：
    
                中文翻譯    原文編號      原文簡義      出現經文
                ------------------------------------------------------------------------------
                觀兆        SNH 6049      觀兆、卜卦    #利 19:26;王下 21:6;代下 33:6|
                ------------------------------------------------------------------------------
                觀兆的      SNH 6049      觀兆者        #申 18:10;申 18:14;賽 2:6;耶 27:9|
                            SNH 1505      觀兆者        #但 2:27;但 4:7;但 5:7;但 5:11|
                ------------------------------------------------------------------------------
                兆頭        SNH 226       記號          #撒上 10:7;撒上 10:9;王下 20:8|
                                                        #王下 20:9;賽 7:11;賽 7:14;賽 38:7|
                                                        #賽 38:22;賽 44:25|
                            SNH 4159      奇蹟          #代下 32:24|
                            SNG 4592      記號          #太 24:30|
                ------------------------------------------------------------------------------
                預兆        SNH 226       記號          #賽 8:18;賽 20:3;耶 44:29;結 4:3|
                            SNH 4159      奇蹟          #王上 13:3;王上 13:5;結 12:6;結 12:11|               
                                                        #結 24:24;結 24:27;亞 3:8|
                ------------------------------------------------------------------------------
                豫兆        SNG 4592      記號          #太 24:3;可 13:4;路 21:7|     
                ------------------------------------------------------------------------------
                異兆        SNG 4592      記號          #路 21:25|
                ------------------------------------------------------------------------------
                夢兆        SNH 2472      夢            #但 1:17|
                ------------------------------------------------------------------------------
    */
    const joTable = {
        rows: 12, cols: 4, cells: [
            { r: 0, c: 0, text: "中文翻譯" },
            { r: 0, c: 1, text: "原文編號" },
            { r: 0, c: 2, text: "原文簡義" },
            { r: 0, c: 3, text: "出現經文" },

            { r: 1, c: 0, text: "觀兆" },
            { r: 1, c: 1, text: "SNH 6049" },
            { r: 1, c: 2, text: "觀兆、卜卦" },
            { r: 1, c: 3, text: "#利 19:26;王下 21:6;代下 33:6|" },

            { r: 2, c: 0, text: "觀兆的", rowSpan: 2 },
            { r: 2, c: 1, text: "SNH 6049" },
            { r: 2, c: 2, text: "觀兆者" },
            { r: 2, c: 3, text: "#申 18:10;申 18:14;賽 2:6;耶 27:9|" },
            { r: 3, c: 1, text: "SNH 1505" },
            { r: 3, c: 2, text: "觀兆者" },
            { r: 3, c: 3, text: "#但 2:27;但 4:7;但 5:7;但 5:11|" },

            { r: 4, c: 0, text: "兆頭", rowSpan: 3 },
            { r: 4, c: 1, text: "SNH 226" },
            { r: 4, c: 2, text: "記號" },
            { r: 4, c: 3, text: "#撒上 10:7,9;王下 20:8,9;賽 7:11,14;38:7,22;44:25|" },
            { r: 5, c: 0, text: "" },
            { r: 5, c: 1, text: "SNH 4159" },
            { r: 5, c: 2, text: "奇蹟" },
            { r: 5, c: 3, text: "#代下 32:24|" },
            { r: 6, c: 0, text: "" },
            { r: 6, c: 1, text: "SNG 4592" },
            { r: 6, c: 2, text: "記號" },
            { r: 6, c: 3, text: "#太 24:30|" },

            { r: 7, c: 0, text: "預兆", rowSpan: 2 },
            { r: 7, c: 1, text: "SNH 226" },
            { r: 7, c: 2, text: "記號" },
            { r: 7, c: 3, text: "#賽 8:18;20:3;耶 44:29;結 4:3|" },
            { r: 8, c: 0, text: "" },
            { r: 8, c: 1, text: "SNH 4159" },
            { r: 8, c: 2, text: "奇蹟" },
            { r: 8, c: 3, text: "#王上 13:3,5;結 12:6,11;24:24,27;亞 3:8|" },

            { r: 9, c: 0, text: "豫兆" },
            { r: 9, c: 1, text: "SNG 4592" },
            { r: 9, c: 2, text: "記號" },
            { r: 9, c: 3, text: "#太 24:3;可 13:4;路 21:7|" },
            { r: 10, c: 0, text: "異兆" },
            { r: 10, c: 1, text: "SNG 4592" },
            { r: 10, c: 2, text: "記號" },
            { r: 10, c: 3, text: "#路 21:25|" },
            { r: 11, c: 0, text: "夢兆" },
            { r: 11, c: 1, text: "SNH 2472" },
            { r: 11, c: 2, text: "夢" },
            { r: 11, c: 3, text: "#但 1:17|" },
        ]
    }
    const re1 = replace_core(com_text, joTable, "「兆」的相關用詞對照表：", "中文翻譯", "#但 1:17|\n            ------------------------------------------------------------------------------")

    /*
                「兆」的相關用詞統計（38筆）：
                
                原文編號                   和合本中文翻譯                       總數
                         觀兆     觀兆的   兆頭    預兆    豫兆    異兆    夢兆    
              SNH 6049     3        4        0       0       0        0       0    7
              SNH 1505     0        4        0       0       0        0       0    4
              SNH 226      0        0        9       4       0        0       0   13
              SNH 4159     0        0        1       7       0        0       0    8
              SNG 4592     0        0        1       0       3        1       0    5
              SNG 2472     0        0        0       0       0        0       1    1
                  總數     3        8       11      11       3        1       1   38
    */
    const joTable2 = {
        rows: 8, cols: 9, cells: [
            { r: 0, c: 0, text: "原文編號" },
            { r: 0, c: 1, text: "和合本中文翻譯", colSpan: 7 },

            { r: 0, c: 8, text: "總數" },
            { r: 1, c: 1, text: "觀兆" },
            { r: 1, c: 2, text: "觀兆的" },
            { r: 1, c: 3, text: "兆頭" },
            { r: 1, c: 4, text: "預兆" },
            { r: 1, c: 5, text: "豫兆" },
            { r: 1, c: 6, text: "異兆" },
            { r: 1, c: 7, text: "夢兆" },

            { r: 2, c: 0, text: "SNH 6049" },
            { r: 2, c: 1, text: "3" },
            { r: 2, c: 2, text: "4" },
            { r: 2, c: 3, text: "0" },
            { r: 2, c: 4, text: "0" },
            { r: 2, c: 5, text: "0" },
            { r: 2, c: 6, text: "0" },
            { r: 2, c: 7, text: "0" },
            { r: 2, c: 8, text: "7" },

            { r: 3, c: 0, text: "SNH 1505" },
            { r: 3, c: 1, text: "0" },
            { r: 3, c: 2, text: "4" },
            { r: 3, c: 3, text: "0" },
            { r: 3, c: 4, text: "0" },
            { r: 3, c: 5, text: "0" },
            { r: 3, c: 6, text: "0" },
            { r: 3, c: 7, text: "0" },
            { r: 3, c: 8, text: "4" },

            { r: 4, c: 0, text: "SNH 226" },
            { r: 4, c: 1, text: "0" },
            { r: 4, c: 2, text: "0" },
            { r: 4, c: 3, text: "9" },
            { r: 4, c: 4, text: "4" },
            { r: 4, c: 5, text: "0" },
            { r: 4, c: 6, text: "0" },
            { r: 4, c: 7, text: "0" },
            { r: 4, c: 8, text: "13" },

            { r: 5, c: 0, text: "SNH 4159" },
            { r: 5, c: 1, text: "0" },
            { r: 5, c: 2, text: "0" },
            { r: 5, c: 3, text: "1" },
            { r: 5, c: 4, text: "7" },
            { r: 5, c: 5, text: "0" },
            { r: 5, c: 6, text: "0" },
            { r: 5, c: 7, text: "0" },
            { r: 5, c: 8, text: "8" },

            { r: 6, c: 0, text: "SNG 4592" },
            { r: 6, c: 1, text: "0" },
            { r: 6, c: 2, text: "0" },
            { r: 6, c: 3, text: "1" },
            { r: 6, c: 4, text: "0" },
            { r: 6, c: 5, text: "3" },
            { r: 6, c: 6, text: "1" },
            { r: 6, c: 7, text: "0" },
            { r: 6, c: 8, text: "5" },

            { r: 7, c: 0, text: "SNG 2472" },
            { r: 7, c: 1, text: "0" },
            { r: 7, c: 2, text: "0" },
            { r: 7, c: 3, text: "0" },
            { r: 7, c: 4, text: "0" },
            { r: 7, c: 5, text: "0" },
            { r: 7, c: 6, text: "0" },
            { r: 7, c: 7, text: "1" },
            { r: 7, c: 8, text: "1" },

            { r: 8, c: 0, text: "總數" },
            { r: 8, c: 1, text: "3" },
            { r: 8, c: 2, text: "8" },
            { r: 8, c: 3, text: "11" },
            { r: 8, c: 4, text: "11" },
            { r: 8, c: 5, text: "3" },
            { r: 8, c: 6, text: "1" },
            { r: 8, c: 7, text: "1" },
            { r: 8, c: 8, text: "38" },
        ]
    }

    const re2 = replace_core(re1, joTable2, "「兆」的相關用詞統計（38筆）：", "原文編號", "38")

    /*
             以原文編號為主來對照：
            原文編號    原文簡義    中文翻譯     出現經文             
            SNH 6049    觀兆、卜卦   觀兆       #利 19:26;王下 21:6;代下 33:6|
                        觀兆者       觀兆的     #申 18:10;申 18:14;賽 2:6;耶 27:9|
            SNH 1505    觀兆者       觀兆的     #但 2:27;但 4:7;但 5:7;但 5:11|
            SNH 226     記號         兆頭       #撒上 10:7;撒上 10:9;王下 20:8|
                                                #王下 20:9;賽 7:11;賽 7:14;賽 38:7|
                                                #賽 38:22;賽 44:25|
            SNH 4159    奇蹟         預兆       #賽 8:18;賽 20:3;耶 44:29;結 4:3|
                                     兆頭       #代下 32:24|
                                     預兆       #王上 13:3;王上 13:5;結 12:6;結 12:11|
                                                #結 24:24;結 24:27;亞 3:8|
            SNG 4592    記號         兆頭       #太 24:30|
                                     豫兆       #太 24:3;可 13:4;路 21:7|
                                     異兆       #路 21:25|
            SNG 2472     夢          夢兆       #但 1:17|
    */
    const joTable3 = {
        rows: 12, cols: 4, cells: [
            { r: 0, c: 0, text: "原文編號" },
            { r: 0, c: 1, text: "原文簡義" },
            { r: 0, c: 2, text: "中文翻譯" },
            { r: 0, c: 3, text: "出現經文" },

            { r: 1, c: 0, text: "SNH 6049", rowSpan: 2 },
            { r: 1, c: 1, text: "觀兆、卜卦" },
            { r: 1, c: 2, text: "觀兆" },
            { r: 1, c: 3, text: "#利 19:26;王下 21:6;代下 33:6|" },
            { r: 2, c: 1, text: "觀兆者" },
            { r: 2, c: 2, text: "觀兆的" },
            { r: 2, c: 3, text: "#申 18:10,14;賽 2:6;耶 27:9|" },

            { r: 3, c: 0, text: "SNH 1505" },
            { r: 3, c: 1, text: "觀兆者" },
            { r: 3, c: 2, text: "觀兆的" },
            { r: 3, c: 3, text: "#但 2:27,4:7,5:7,5:11|" },

            { r: 4, c: 0, text: "SNH 226" },
            { r: 4, c: 1, text: "記號" },
            { r: 4, c: 2, text: "兆頭" },
            { r: 4, c: 3, text: "#撒上 10:7,9;王下 20:8,9;賽 7:11,14;38:7,22;44:25|" },

            { r: 5, c: 0, text: "SNH 4159", rowSpan: 3 },
            { r: 5, c: 1, text: "奇蹟", rowSpan: 3 },
            { r: 5, c: 2, text: "預兆" },
            { r: 5, c: 3, text: "#賽 8:18;20:3;耶 44:29;結 4:3|" },
            { r: 6, c: 2, text: "兆頭" },
            { r: 6, c: 3, text: "#代下 32:24|" },
            { r: 7, c: 2, text: "預兆" },
            { r: 7, c: 3, text: "#王上 13:3,5;結 12:6,11;24:24,27;亞 3:8|" },

            { r: 8, c: 0, text: "SNG 4592", rowSpan: 3 },
            { r: 8, c: 1, text: "記號", rowSpan: 3 },
            { r: 8, c: 2, text: "兆頭" },
            { r: 8, c: 3, text: "#太 24:30|" },
            { r: 9, c: 2, text: "豫兆" },
            { r: 9, c: 3, text: "#太 24:3;可 13:4;路 21:7|" },
            { r: 10, c: 2, text: "異兆" },
            { r: 10, c: 3, text: "#路 21:25|" },
            { r: 11, c: 0, text: "SNG 2472" },
            { r: 11, c: 1, text: "夢", rowSpan: 1 },
            { r: 11, c: 2, text: "夢兆" },
            { r: 11, c: 3, text: "#但 1:17|" },
        ]
    }

    const re3 = replace_core(re2, joTable3, "以原文編號為主來對照：", "原文編號", "#但 1:17|")
    return re3
}


function getLineIndentAt(s, index) {
    const lineStart = s.lastIndexOf('\n', index);
    const start = lineStart === -1 ? 0 : lineStart + 1;

    let i = start;
    while (i < s.length && (s[i] === ' ' || s[i] === '\t')) i++;

    return s.slice(start, i); // 回傳前置空白字串（spaces/tabs）
}

/**
 * 因為 replace 遇到換行可能會不準確（尤其是 Windows 的 \r\n），所以改用 slice 的方式來取代特定區塊的文字
 * @param {string} text 
 * @param {object} joTable 
 * @param {string} header 
 * @param {string} header2 
 * @param {string} header3 
 * @returns {string}
 */
function replace_core(text, joTable, header, header2, header3) {
    const blockStart = text.indexOf(header)
    if (blockStart == -1) { return text }

    const blockSart2 = text.indexOf(header2, blockStart)
    if (blockSart2 == -1) { return text }

    const blockEnd = text.indexOf(header3, blockSart2)
    if (blockEnd == -1) { return text }

    // ✅ 取「header 所在行」的前置空白當作 indent（讓 JSON 跟著縮排）
    const indent = getLineIndentAt(text, blockStart);

    const jsonLine = `${indent}${JSON.stringify(joTable)}`;

    return (
        text.slice(0, blockStart + header.length) +
        `\n${jsonLine}\n` +
        text.slice(blockEnd + header3.length)
    );
}